server/test/LOAD_TESTING/spike.yml
# test/spike.yml
config:
  target: "http://localhost:5001"
  http:
    timeout: 15
    pool: 256
  plugins:
    metrics-by-endpoint: {}
    expect: {}

  phases:
    # Brief settle period at light load
    - duration: 20
      arrivalRate: 5
      name: "Settle"

    # Sudden spike (wall) — push the system hard
    - duration: 30
      arrivalRate: 70
      name: "Spike: 70 rps"

    # Recovery at target load
    - duration: 60
      arrivalRate: 15
      name: "Recover at target"

    # Cool down
    - duration: 20
      arrivalRate: 5
      name: "Cool-down"

  # Spike thresholds (looser than steady-state)
  ensure:
    maxErrorRate: 2      # ≤ 2% during spike window
    p99: 4000            # p99 < 4s under spike
    p95: 2500            # p95 < 2.5s under spike

  defaults:
    headers:
      Content-Type: application/json

scenarios:
  # Same mixes as load test (weights preserved)
  - name: "Database Health Check"
    weight: 2
    flow:
      - get: { url: "/api/test-db" }
      - think: 0.1

  - name: "Browse Products"
    weight: 5
    flow:
      - get: { url: "/api/products" }
      - think: 0.1
      - get:
          url: "/api/products?page={{ $randomNumber(1,3) }}&limit=10"
      - think: 0.1

  - name: "Browse Categories"
    weight: 3
    flow:
      - get: { url: "/api/categories" }
      - think: 0.1
      - get: { url: "/api/products" }